app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "IYn9HbaJ6HKVGOV2qeeLCQ"], ["LIMIT", 1]]
---
  def self.random_code
    while true
      short_url = SecureRandom.urlsafe_base64

      return short_url unless self.exists?(short_url: short_url)