app/models/user.rb

  def shorten_url(long_url)
    return false if self.id.nil?
    short_url = ShortenedUrl.random_code
    shortened_url = ShortenedUrl.new(long_url: long_url, submitter_id: self.id, short_url: short_url)
    return short_url if shortened_url.save!
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "created_at", "updated_at", "submitter_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "GtcOFq617J2Ct2lNLC5bAA"], ["long_url", "www.google.com"], ["created_at", "2019-04-22 19:54:37.898389"], ["updated_at", "2019-04-22 19:54:37.898389"], ["submitter_id", 1]]