app/models/visit.rb

INSERT INTO "visits" ("user_id", "url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["url_id", 2], ["created_at", "2019-04-20 21:44:28.602505"], ["updated_at", "2019-04-20 21:44:28.602505"]]
---
  def self.record_visit!(user, shortened_url)
    return false if user.id.nil? || shortened_url.id.nil?
    visit = Visit.new(user_id: user.id, url_id: shortened_url.id)
    return true if visit.save!